 gcc -g p2original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x805: file p2original.c, line 39.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:39
39      a=input_side();
(gdb) n
Enter a value
3
40      b=input_side();
(gdb) n
Enter a value
2
41      c=input_side();
(gdb) n
Enter a value
5
42      check_scalene(a,b,c);
(gdb) s
check_scalene (a=3, b=2, c=5) at p2original.c:12
12    if(a==b && b==c)
(gdb) s
16    else if(a!=b && b==c && a==c)
(gdb) s
22      r = scalene;
(gdb) s
24  }
(gdb) n
main () at p2original.c:43
43      output(a,b,c,scalene);
(gdb) n
Triangle is Scalene
44      return 0;
(gdb) c
Continuing.
[Inferior 1 (process 83) exited normally]
(gdb) 
